Revit 2022 API
DocumentEntryPoint.Import Method
Overload List
Name | Description
Import(String, GBXMLImportOptions)
Imports a Green-Building XML file into the document.
 (Inherited from Document.)
Import(String, ImportOptions3DM, View)
 Imports a 3DM file into the document.
 (Inherited from Document.)
Import(String, SATImportOptions, View)
 Imports an SAT file into the document.
 (Inherited from Document.)
Import(String, SKPImportOptions, View)
 Imports a SKP file into the document.
 (Inherited from Document.)
Import(String, DGNImportOptions, View, ElementId)
 Imports a DGN file to the document.
 (Inherited from Document.)
Import(String, DWGImportOptions, View, ElementId)
 Imports a DWG or DXF file to the document.
 (Inherited from Document.)
See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace